Autodesk.Revit.DB.DataConversionMonitorScope.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DataConversionMonitorScope.#ctor(Autodesk.Revit.DB.IDataConversionMonitor)
The only constructor. Expects a valid pointer to IDataConversionMonitor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DataConversionMonitorScope
This class is used to regsiter an application-supplied object that implements IDataConversionMonitor.
Creating the object registers an implementation of IDataConversionMonitor supplied as constructor argument.
When the scope object is destroyed, that object is unregistered.
Since:
2016